Move README to root
